template_version: 0.6
id: custom-1783605183560-s4ezfx
title: Malicious Usage Of IMDS Credentials Outside Of AWS Infrastructure
description: |-
  Detects when an instance identity has taken an action that isn't inside SSM.
  This can indicate that a compromised EC2 instance is being used as a pivot point.
status: test
logsource:
  scope: multi
  sources:
    - category: cloud
      product: aws
level: high
detection:
  kql_query: |-
    dataset="aws_dataset1_a"
    | where userIdentity.arn matches regex @'.+:assumed-role/aws:.+'
    | where not(eventSource == 'ssm.amazonaws.com')
    | where not(eventName == 'RegisterManagedInstance')
    | where not(sourceIPAddress == 'AWS Internal')
references:
  - https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-instance-identity-roles.html
  - https://ermetic.com/blog/aws/aws-ec2-imds-what-you-need-to-know/
  - https://www.packetmischief.ca/2023/07/31/amazon-ec2-credential-exfiltration-how-it-happens-and-how-to-mitigate-it/#lifting-credentials-from-imds-this-is-why-we-cant-have-nice-things
author: jamesc-grafana
date: '2024-07-11T00:00:00.000Z'
tags:
  - sigma-import
  - aws
  - cloudtrail
  - ai-translated
falsepositives: A team has configured an EC2 instance to use instance profiles that grant the option for the EC2 instance to talk to other AWS Services
matcher:
  format: sigma
  logsource:
    product: aws
    service: cloudtrail
  detection:
    selection:
      userIdentity.arn|re: .+:assumed-role/aws:.+
    filter_main_generic:
      - eventSource: ssm.amazonaws.com
      - eventName: RegisterManagedInstance
      - sourceIPAddress: AWS Internal
    condition: selection and not 1 of filter_main_*
provenance:
  format: sigma
  feed_id: sigmahq-core
  source_ref: rules/cloud/aws/cloudtrail/aws_cloudtrail_imds_malicious_usage.yml
  original: |
    title: Malicious Usage Of IMDS Credentials Outside Of AWS Infrastructure
    id: 352a918a-34d8-4882-8470-44830c507aa3
    status: test
    description: |
        Detects when an instance identity has taken an action that isn't inside SSM.
        This can indicate that a compromised EC2 instance is being used as a pivot point.
    references:
        - https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-instance-identity-roles.html
        - https://ermetic.com/blog/aws/aws-ec2-imds-what-you-need-to-know/
        - https://www.packetmischief.ca/2023/07/31/amazon-ec2-credential-exfiltration-how-it-happens-and-how-to-mitigate-it/#lifting-credentials-from-imds-this-is-why-we-cant-have-nice-things
    author: jamesc-grafana
    date: 2024-07-11
    tags:
        - attack.privilege-escalation
        - attack.initial-access
        - attack.persistence
        - attack.stealth
        - attack.t1078
        - attack.t1078.002
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            userIdentity.arn|re: '.+:assumed-role/aws:.+'
        filter_main_generic:
            - eventSource: 'ssm.amazonaws.com'
            - eventName: 'RegisterManagedInstance'
            - sourceIPAddress: 'AWS Internal'
        condition: selection and not 1 of filter_main_*
    falsepositives:
        - A team has configured an EC2 instance to use instance profiles that grant the option for the EC2 instance to talk to other AWS Services
    level: high
  license_id: DRL-1.1
  upstream_author: jamesc-grafana
  upstream_status: test
